act
actionlint
bash
bat
cloc
cmake
diff-so-fancy
direnv
docker
docker-completion
docker-compose
duti
eza
fd
fnm
gh
go
htop
just
kustomize
lazygit
neovim
node
pipenv
pyenv
ripgrep
rust
shellcheck
sponge
the_silver_searcher
tree-sitter
yq
zoxide
