ack
alacritty
albert
alsa-utils
arc-gtk-theme
aria2
autoconf
automake
awesome
base
bind
binutils
bison
bitwarden-bin
breeze
breeze-icons
build2
cabal-install
chromium
clang
cmake
cmus
code
compton-conf
ctags
dialog
discord
dmenu
dmidecode
docker
efibootmgr
emacs
exfat-utils
faenza-icon-theme
fakeroot
fd
file
findutils
firefox
flex
fmt
fnm-bin
galculator
gawk
gcc
gdb
gdlauncher-bin
geekbench
gettext
ghc-static
git
github-cli
glances
gmrun
gnome-clocks
gnome-control-center
gnome-disk-utility
gnome-screenshot
gnome-system-monitor
gnome-terminal
gnome-tweaks
gnu-free-fonts
gpick
grep
groff
grub
grub-customizer
gtk4
gvim
gzip
haskell-base-prelude
htmlq-bin
htop
hwinfo
ipython
jre-openjdk
kodi
layan-gtk-theme-git
lib32-clang
lib32-systemd
libtool
lightdm
lightdm-gtk-greeter
lightdm-slick-greeter
lightdm-webkit2-greeter
linux
linux-firmware
llvm
lshw
lxappearance
lynx
m4
make
mpv
nautilus
ncurses5-compat-libs
neovim
nerd-fonts-fira-code
nerd-fonts-mononoki
network-manager-applet
networkmanager
nitrogen
nodejs-lts-fermium
nomacs
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
npm
nvidia
nvidia-dkms
nvidia-settings
openbox
openssh
openvpn-update-resolv-conf-git
opera
orchis-theme-git
os-prober
otf-font-awesome-5-free
pacman
papirus-icon-theme
patch
pavucontrol
phoronix-test-suite
picom
pkgconf
protonvpn
psensor
pulseaudio
pulseaudio-alsa
python-pip
qbittorrent
qtile
rclone
reflector
rsync
ruby
rxvt-unicode
screenfetch
scrot
sed
stack
starship
steam-native-runtime
sudo
sysbench
telegram-desktop-bin
telegram-tdlib-git
terminator
texinfo
the_silver_searcher
thunderbird
tmux
tor
torbrowser-launcher
ttf-dejavu
ttf-fira-code
ttf-fira-mono
ttf-font-awesome
ttf-hack
ttf-inconsolata
ttf-liberation
ttf-linux-libertine
ttf-ms-fonts
ttf-ubuntu-font-family
ulauncher
vlc
which
wireshark-qt
woff-fira-code
xcompmgr
xdg-user-dirs
xdg-utils
xkb-switch-git
xmobar
xmonad
xmonad-contrib
xorg-bdftopcf
xorg-iceauth
xorg-mkfontscale
xorg-server-xephyr
xorg-sessreg
xorg-smproxy
xorg-x11perf
xorg-xbacklight
xorg-xcmsdb
xorg-xcursorgen
xorg-xdpyinfo
xorg-xdriinfo
xorg-xev
xorg-xfontsel
xorg-xgamma
xorg-xhost
xorg-xinit
xorg-xinput
xorg-xkbevd
xorg-xkbutils
xorg-xkill
xorg-xlsatoms
xorg-xlsclients
xorg-xlsfonts
xorg-xpr
xorg-xrefresh
xorg-xsetroot
xorg-xvinfo
xorg-xwd
xorg-xwininfo
xorg-xwud
xsel
xterm
yay-git
youtube-dl
zsh
zsh-syntax-highlighting
