;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

(package! prettier-js)
(package! flycheck)
(package! flycheck-mix)
(package! graphql-mode)
(package! racer)
(package! org)
(package! lsp-mode)
(package! lsp-ui)
(package! yapfify)
;; (package! company-lsp)
(package! dockerfile-mode)
(package! aggressive-indent)
(package! blacken)
(package! lsp-python-ms :disable t)
;;(package! company-box)
;(package! ob-ipython)
