{
  "AutumnLeaf": { "branch": "master" },
  "CurtineIncSw.vim": { "branch": "master" },
  "HowMuch": { "branch": "master" },
  "Jenkinsfile-vim-syntax": { "branch": "master" },
  "LuaSnip": { "branch": "master" },
  "ack.vim": { "branch": "master" },
  "ale": { "branch": "master" },
  "async.vim": { "branch": "master" },
  "ayu-vim": { "branch": "master" },
  "cmp-buffer": { "branch": "main" },
  "cmp-nvim-lsp": { "branch": "main" },
  "cmp-path": { "branch": "main" },
  "cmp_luasnip": { "branch": "master" },
  "coc.nvim": { "branch": "release" },
  "eclipse.vim": { "branch": "master" },
  "editorconfig-vim": { "branch": "master" },
  "falcon": { "branch": "master" },
  "fzf.vim": { "branch": "master" },
  "graphviz.vim": { "branch": "master" },
  "groovy.vim": { "branch": "master" },
  "ironman.vim": { "branch": "master" },
  "isort.vim": { "branch": "master" },
  "jellybeans.vim": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "lightline.vim": { "branch": "master" },
  "loremipsum": { "branch": "master" },
  "molokai": { "branch": "master" },
  "mru": { "branch": "master" },
  "nerdtree": { "branch": "master" },
  "nvim-cmp": { "branch": "main" },
  "nvim-lspconfig": { "branch": "master" },
  "nvim-spectre": { "branch": "master" },
  "papercolor-theme": { "branch": "master" },
  "plenary.nvim": { "branch": "master" },
  "python-syntax": { "branch": "master" },
  "rust-analyzer": { "branch": "master" },
  "spaceduck": { "branch": "main" },
  "summerfruit256.vim": { "branch": "master" },
  "tcomment_vim": { "branch": "master" },
  "telescope-fzf-native.nvim": { "branch": "main" },
  "telescope.nvim": { "branch": "master" },
  "typescript-vim": { "branch": "master" },
  "typescript.nvim": { "branch": "main" },
  "vim-abolish": { "branch": "master" },
  "vim-case-convert": { "branch": "master" },
  "vim-clang-format": { "branch": "master" },
  "vim-cmake-syntax": { "branch": "master" },
  "vim-esearch": { "branch": "master" },
  "vim-eunuch": { "branch": "master" },
  "vim-fugitive": { "branch": "master" },
  "vim-gitgutter": { "branch": "main" },
  "vim-glsl": { "branch": "master" },
  "vim-go": { "branch": "master" },
  "vim-illuminate": { "branch": "master" },
  "vim-json": { "branch": "master" },
  "vim-markdown": { "branch": "master" },
  "vim-operator-user": { "branch": "master" },
  "vim-polyglot": { "branch": "master" },
  "vim-pyte": { "branch": "master" },
  "vim-snippets": { "branch": "master" },
  "vim-surround": { "branch": "master" },
  "vim-svelte": { "branch": "main" },
  "vim-syntax-extra": { "branch": "master" },
  "vim-visual-multi": { "branch": "master" }
}
